[
  {
    "role": "Software Engineer",
    "organisation": "Reliance Jio",
    "startDate": "May, 2020",
    "endDate": "Aug, 2022",
    "experiences": [
        "Developed 20+ RESTful APIs in Java, Spring Boot, and Hibernate for seamless smart home IoT connectivity.",
        "Secured API requests with OAuth, JWT, and HMAC, protecting over 1k+ user sessions and sensitive data.",
        "Automated real-time ETL pipeline in Java with Spark for 10,000+ IoT data points, utilizing Spark SQL and DataFrame API for intricate transformations, and seamless integration with HDFS (Hadoop File System) for optimized storage, enhancing operational efficiency.",
        "Implemented custom Java MapReduce jobs for efficient processing and analysis of large-scale smart home energy usage datasets in HDFS, enhancing performance and resource utilization.",
        "Enhanced PostgreSQL performance and scalability for 1M+ device metadata by implementing optimization techniques like indexing, query planning, and database tuning.",
        "Prioritized and delivered 30+ enhancements aligned with business objectives through stakeholder collaboration.",
        "Resolved 300+ production and deployment issues through root cause identification and efficient debugging.",
        "Integrated unit and integration testing into Azure CI/CD pipelines, reducing production issues by 50%."
      
  ],
    "imageSrc": "history/jio.png"
  },
  {
    "role": "Machine Learning Intern",
    "organisation": "ITC",
    "startDate": "May, 2019",
    "endDate": "Jul, 2019",
    "experiences": [
      "Created an application using Python, PyTorch, CNN, and Flask to predict paper pulp ISO brightness, addressing 500+ data accuracy challenges.",
      "Delivered a robust solution enabling the organization to produce quality paper within seconds, reducing manual labor by 6 hours."
  ],
    "imageSrc": "history/itc.png"
  },
  {
    "role": "Software Development Intern",
    "organisation": "RINL",
    "startDate": "Jun, 2018",
    "endDate": "Aug, 2018",
    "experiences": [
      "Enhanced the price estimator tool interface for a reverse auction project, offering transparent cost breakdowns across 20+ data services.",
      "Overhauled workflow management tools through a new database system to increase task accountability and communication.",
      "Refactored 1000+ lines of code and documented two large-scale projects, improving future readability and understanding."
  ],
    "imageSrc": "history/rinl.png"
  }
]
